// ПРИМЕР РУЧНОЙ КАЛИБРОВКИ КООРДИНАТ ДЖОЙСТИКА:  // * Строки со звёздочкой являются необязательными.
                                                  //
#include <Wire.h>                                 // * Подключаем библиотеку для работы с аппаратной шиной I2C.
#include <iarduino_I2C_Joystick.h>                //   Подключаем библиотеку для работы с джойстиком I2C-flash.
iarduino_I2C_Joystick joy(0x09);                  //   Объявляем объект joy для работы с функциями и методами библиотеки iarduino_I2C_Joystick, указывая адрес модуля на шине I2C.
                                                  //   Если объявить объект без указания адреса (iarduino_I2C_Joystick joy;), то адрес будет найден автоматически.
void setup(){                                     //
    delay(500);                                   // * Ждём завершение переходных процессов связанных с подачей питания.
    Serial.begin(9600);                           //
    while(!Serial){;}                             // * Ждём завершения инициализации шины UART.
    joy.begin();                                  //   Инициируем работу с джойстиком.
//  Калибровка осей указанием значений АЦП:       //
    joy.setCalibration_X(0, 2047, 4095);          //   Калибруем ось X указывая АЦП крайнего левого  положения (0), АЦП центра (2047), АЦП крайнего правого  положения (4095).
    joy.setCalibration_Y(0, 2047, 4095);          //   Калибруем ось Y указывая АЦП крайнего нижнего положения (0), АЦП центра (2047), АЦП крайнего верхнего положения (4095).
}                                                 //   Если направление оси требуется изменить, то поменяйте местами крайние значения АЦП оси (0 <-> 4095).
                                                  //
void loop(){                                      //
    Serial.print( "X:Y=" );                       //
    Serial.print( joy.getPosition_X() );          //   Выводим координату по оси X, значение от -100 до 100.
    Serial.print( ":" );                          //
    Serial.print( joy.getPosition_Y() );          //   Выводим координату по оси Y, значение от -100 до 100.
    Serial.print( "\r\n" );                       //
}                                                 //
/*  Примечание:
 *  Значения АЦП у разных джойстиков могут отличаться
 *  Точные показания АЦП для каждого положения Вашего
 *  джойстика Вы можете узнать из примера «GetADC».
 */